In [1]:
# Import libraries
import mysql.connector 
import pandas as pd

In [2]:
# Create connection
mydb = mysql.connector.connect(
    host = 'localhost',
    user = 'root',
    passwd = '101014sd',
    database = 'retrowheels'
)

In [21]:
# Soal 1
mycursor = mydb.cursor()

query = 'SELECT off.city, COUNT(e.officeCode) AS employeeNumber FROM offices AS off INNER JOIN employees as e USING (officeCode) GROUP BY officeCode ORDER BY COUNT(e.officeCode) DESC'

mycursor.execute(query)

result = mycursor.fetchall()

df = pd.DataFrame(result, columns = mycursor.column_names)
df

            city  employeeNumber
0  San Francisco               6
1          Paris               5
2         Sydney               4
3         Boston               2
4            NYC               2
5          Tokyo               2
6         London               2

In [32]:
# Soal 2
mycursor = mydb.cursor()

query = 'SELECT COUNT(DISTINCT(pl.productLine)) AS ProductLineNum, COUNT(p.productName) AS ProductNumber  FROM productlines AS pl INNER JOIN products as p USING (productLine)'

mycursor.execute(query)

result = mycursor.fetchall()

df = pd.DataFrame(result, columns = mycursor.column_names)
df

   ProductLineNum  ProductNumber
0               7            110

In [37]:
# Soal 3
mycursor = mydb.cursor()

query = 'SELECT p.productCode, p.productName, p.productLine, SUM(od.quantityOrdered) AS orderQuantity FROM products AS p INNER JOIN orderdetails as od USING (productCode) GROUP BY productCode ORDER BY SUM(od.quantityOrdered) DESC LIMIT 5'

mycursor.execute(query)

result = mycursor.fetchall()

df = pd.DataFrame(result, columns = mycursor.column_names)
df

,productCode,productName,productLine,orderQuantity
0,S18_3232,1992 Ferrari 360 Spider red,Classic Cars,1808
1,S18_1342,1937 Lincoln Berline,Vintage Cars,1111
2,S700_4002,American Airlines: MD-11S,Planes,1085
3,S18_3856,1941 Chevrolet Special Deluxe Cabriolet,Vintage Cars,1076
4,S50_1341,1930 Buick Marquette Phaeton,Vintage Cars,1074

In [96]:
# Soal 4
mycursor = mydb.cursor()

query = 'SELECT c.customerName,c.city, c.country, sum(od.quantityOrdered) AS totalOrder FROM orderdetails as od INNER JOIN orders AS o USING (orderNumber) INNER JOIN customers AS c USING (customerNumber) WHERE productCode="S18_3232" group by customerName ORDER BY SUM(od.quantityOrdered) DESC'

mycursor.execute(query)

result = mycursor.fetchall()

df = pd.DataFrame(result, columns = mycursor.column_names)
df.head(5)

                   customerName          city      country totalOrder
0        Euro+ Shopping Channel        Madrid        Spain        308
1               Vida Sport, Ltd        Genève  Switzerland         79
2  Motor Mint Distributors Inc.  Philadelphia          USA         73
3            Muscle Machine Inc           NYC          USA         70
4       Oulu Toy Supplies, Inc.          Oulu      Finland         68

In [157]:
# Soal 5
mycursor = mydb.cursor()

query = 'SELECT p.productCode, p.productName, p.productLine, avg(quantityOrdered) from products as p inner join orderdetails as od using (productCode) where productLine="Vintage Cars" group by productCode order by avg(quantityOrdered) asc '
mycursor.execute(query)

result = mycursor.fetchall()

df = pd.DataFrame(result, columns = mycursor.column_names)
df

,productCode,productName,productLine,avg(quantityOrdered)
0,S18_2795,1928 Mercedes-Benz SSK,Vintage Cars,31.4286
1,S24_3420,1937 Horch 930V Limousine,Vintage Cars,31.5714
2,S18_3136,18th Century Vintage Horse Carriage,Vintage Cars,32.3929
3,S18_3140,1903 Ford Model A,Vintage Cars,32.7037
4,S24_3969,1936 Mercedes Benz 500k Roadster,Vintage Cars,32.9600
5,S24_3816,1940 Ford Delivery Sedan,Vintage Cars,32.9643
6,S18_2248,1911 Ford Town Car,Vintage Cars,33.2800
7,S24_1937,1939 Chevrolet Deluxe Coupe,Vintage Cars,33.4643
8,S24_2022,1938 Cadillac V-16 Presidential Limousine,Vintage Cars,34.1071
9,S18_2325,1932 Model A Ford J-Coupe,Vintage Cars,34.1786
10,S18_1367,1936 Mercedes-Benz 500K Special Roadster,Vintage Cars,34.2857
11,S18_4409,1932 Alfa Romeo 8C2300 Spider Sport,Vintage Cars,34.6400
12,S32_4289,1928 Ford Phaeton Deluxe,Vintage Cars,34.7143
13,S24_4258,1936 Chrysler Airflow,Vintage Cars,35.1071
14,S18_2957,1934 Ford V8 Coupe,Vintage Cars,35.1786
15,S18_3320,1917 Maxwell Touring Car,Vintage Cars,35.4286
16,S18_4668,1939 Cadillac Limousine,Vintage Cars,35.5357
17,S18_4522,1904 Buick Runabout,Vintage Cars,36.6667
18,S24_3151,1912 Ford Model T Delivery Wagon,Vintage Cars,36.7037
19,S18_1749,1917 Grand Touring Sedan,Vintage Cars,36.7200
20,S18_2949,1913 Ford Model T Speedster,Vintage Cars,37.0714
21,S50_1341,1930 Buick Marquette Phaeton,Vintage Cars,38.3571
22,S18_3856,1941 Chevrolet Special Deluxe Cabriolet,Vintage Cars,38.4286
23,S18_1342,1937 Lincoln Berline,Vintage Cars,39.6786